In [27]:
import pandas as pd
import numpy as np

In [28]:
example_data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 90000]
}
df = pd.DataFrame(example_data)
df

      Name  Age         City  Salary
0    Alice   25     New York   70000
1      Bob   30  Los Angeles   80000
2  Charlie   35      Chicago   90000

In [29]:
# Series
# Creating a Series
data = ['data1', 'data2', 'data3']
s = pd.Series(data)
s

0    data1
1    data2
2    data3
dtype: object

In [30]:
#series from dictionary
data_dict = {'a': 1, 'b': 2, 'c': 3}
s_dict = pd.Series(data_dict)   
s_dict

a    1
b    2
c    3
dtype: int64

In [31]:
data = ['data1', 'data2', 'data3']
inds = ['ind1', 'ind2', 'ind3']
s = pd.Series(data, index=inds)
s

ind1    data1
ind2    data2
ind3    data3
dtype: object

In [32]:
s['ind1']  # Accessing a single value
s[['ind1', 'ind2']]  # Accessing multiple values

ind1    data1
ind2    data2
dtype: object

In [33]:
dataframe = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})  
dataframe

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [34]:
dataframe['A']  # Accessing a single column

0    1
1    2
2    3
Name: A, dtype: int64

In [35]:
dataframe.loc[0]  # Accessing a single row
dataframe.iloc[0]  # Accessing a single row by index

A    1
B    4
C    7
Name: 0, dtype: int64

In [36]:
dataframe.drop('A', axis=1, inplace=True)  # Dropping a column]

In [37]:
dataframe

   B  C
0  4  7
1  5  8
2  6  9

In [38]:
dataframe.iloc[0, 1]  # Accessing a single value by row and column index

np.int64(7)

In [39]:
dataframe.at[0, 'B']  # Accessing a single value by row and column label

np.int64(4)

In [40]:
dataframe

   B  C
0  4  7
1  5  8
2  6  9

In [ ]:
dataframe['B'] = dataframe['B']*100

In [44]:
dataframe

     B  C
0  700  7
1  800  8
2  900  9

In [52]:
dic = {'A': [1, [1,[2, (8,9) , {5345:54}],3],90], 'B': [4, 5, 6], 'C': [7, 8, 9]}
dataframe = pd.DataFrame(dic)
dataframe

                                 A  B  C
0                                1  4  7
1  [1, [2, (8, 9), {5345: 54}], 3]  5  8
2                               90  6  9

In [56]:
dataframe.at[1, 'A'][1][2][5345]

54